cavity5-curve/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

dy1     0;
dy2     5;

dz0       0;
dz1      -0.3535;
dz2       0.3535;
dz3       0.6465
dz4      -0.6465;

dx0       0;
dx1      -0.3535;
dx2       0.3535;
dx3       0.6465;
dx4      -0.6465;



vertices
(
    //vertices da face esquerda externa
    ($dx1 $dy1 $dz2) // 0
    ($dx2 $dy1 $dz2) // 1
    ($dx3 $dy1 $dz2) // 2
    ($dx4 $dy1 $dz2) // 3
    
    ($dx4 $dy2 $dz2) // 4
    ($dx3 $dy2 $dz2) // 5
    ($dx2 $dy2 $dz2) // 6
    ($dx1 $dy2 $dz2)// 7

//vertices da face esquerda interna
    ($dx1 $dy1 $dz1) // 8
    ($dx2 $dy1 $dz1) // 9
    ($dx3 $dy1 $dz1) // 10
    ($dx4 $dy1 $dz1) // 11
    
    ($dx4 $dy2 $dz1) // 12
    ($dx3 $dy2 $dz1) // 13
    ($dx2 $dy2 $dz1) // 14
    ($dx1 $dy2 $dz1) // 15

    ($dx1 $dy1 $dz3) // 16
    ($dx2 $dy1 $dz3) // 17
    ($dx3 $dy1 $dz3) // 18
    ($dx4 $dy1 $dz3) // 19

    ($dx4 $dy2 $dz3) // 20
    ($dx3 $dy2 $dz3) // 21
    ($dx2 $dy2 $dz3) // 22
    ($dx1 $dy2 $dz3) // 23
   
    ($dx1 $dy1 $dz4) // 24
    ($dx2 $dy1 $dz4) // 25
    ($dx3 $dy1 $dz4) // 26
    ($dx4 $dy1 $dz4) // 27
    
    ($dx4 $dy2 $dz4) // 28
    ($dx3 $dy2 $dz4) // 29
    ($dx2 $dy2 $dz4) // 30
    ($dx1 $dy2 $dz4) // 31
    
);

blocks
(
   //front
    hex (0 1 6 7 8 9 14 15) (10 10 10) simpleGrading (1 1 1)
    hex (8 9 14 15 16 17 22 23) (10 10 10) simpleGrading (1 1 1)
    
    //center
    hex (1 2 5 6 9 10 13 14) (10 10 10) simpleGrading (1 1 1)
    hex (2 3 4 5 10 11 12 13) (10 10 10) simpleGrading (1 1 1)
    hex (10 11 12 13 18 19 20 21) (10 10 10) simpleGrading (1 1 1)
   
    //
    hex (16 17 22 23 24 25 30 31) (10 10 10) simpleGrading (1 1 1)
    hex (17 18 21 22 25 26 29 30) (10 10 10) simpleGrading (1 1 1)
    hex (18 19 20 21 26 27 28 29) (10 10 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet //entrada
    {
        type patch;
        faces
        (
            (7 15 14 6)
            (6 14 13 5)
            (5 13 12 4)
            (13 21 20 12)
            (15 23 22 14)  
            (23 31 30 22)
            (22 30 29 21)
            (21 29 28 20) 
            //

           

        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 1 9 8)
            (8 9 17 16)  
            (16 17 25 24)
            (1 2 10 9)
            (17 18 26 25)
            (2 3 11 10)
            (10 11 19 18)
            (18 19 27 26) 

           

        );
     }
    walls
    {
        type wall;
        faces
        (
           //front
            (0 8 15 7)
            (8 16 23 15)
            (16 24 31 23)
//
           //back
            (3 4 12 11)
            (11 12 20 19)
            (19 20 28 27)


            //left
            (0 7 6 1)
            (1 6 5 2)
            (2 5 4 3)

            //right
            (24 25 30 31)
            (25 26 29 30)
            (26 27 28 29)

            (9 14 22 17)
            (10 18 21 13)
            (17 22 21 18)
            (9 10 13 14)

        );
    }
);

mergePatchPairs
(
);

// ************************* //